Repository: vietnguyensaccount/AI_Chatbot_Android
Catalog: stt_llm_tts/record/alsa-utils/alsaconf/po/*.po
Languages: eu

source: ALSA configurator
eu: ALSA konfiguratzailea

source: usage: alsaconf [options] -l|--legacy check only legacy non-isapnp cards -m|--modinfo read module descriptions instead of reading card db -s|--sound wav-file use the specified wav file as a test sound -u|--uid uid set the uid for the ALSA devices (default = 0) [obsoleted] -g|--gid gid set the gid for the ALSA devices (default = 0) [obsoleted] -d|--devmode mode set the permission for ALSA devices (default = 0666) [obs.] -r|--strict set strict device mode (equiv. with -g 17 -d 0660) [obsoleted] -L|--log file logging on the specified file (for debugging purpose only) -p|--probe card-name probe a legacy non-isapnp card and print module options -P|--listprobe list the supported legacy card modules -c|--config file specify the module config file -R|--resources list available DMA and IRQ resources with debug for legacy -h|--help what you're reading
eu: erabilera: alsaconf [aukerak] -l|--legacy egiaztatu soilik isapnp ez diren txartel zaharrak -m|--modinfo irakurri moduluen deskribapenak txartelen dBak beharrean -s|--sound wav-fitxategia erabili zehaztutako wav fitxategia soinu-proba gisa -u|--uid UID ezarri ALSA gailuetarako UIDak (lehenetsia = 0) [zaharkitua] -g|--gid GID ezarri ALSA gailuetarako GIDak (lehenetsia = 0) [zaharkitua] -d|--devmode modua ezarri ALSA gailuentzat baimenak (lehenetsia = 0666) [zaharkitua] -r|--strict ezarri gailu zorrotz modua (-g 17 -d 0660 komanduaren baliokide [zahark.] -L|--log fitxategia zehaztutako fitxategian gordetzea erregistroa (arazte-xedetarako soilik) -p|--probe txartel-izena probatu isapnp ez diren txartel zaharrak eta erakutsi moduluen aukerak -P|--listprobe zerrendatu onartutako txartel zaharren moduluak -c|--config fitxategia zehaztu moduluen konfigurazio fitxategia -R|--resources zerrendatu DMA eta IRQ baliabide eskuragarriak txartel zaharrak arazteko -h|--help laguntza-koadro hau

source: You must be root to use this script.
eu: Root izan behar duzu script hau erabiltzeko.

source: ERROR: The config file doesn't exist:
eu: ERROREA: Konfigurazio-fitxategia ez dago:

source: Error, dialog or whiptail not found.
eu: Errorea: ez da aurkituelkarrizketa-koadro edo whiptail-ik.

source: Error, awk not found. Can't continue.
eu: Errorea: ez da aurkitu awk-ik. Ezin da aurrera egin.

source: ALSA CONFIGURATOR version %s This script is a configurator for Advanced Linux Sound Architecture (ALSA) driver. If ALSA is already running, you should close all sound apps now and stop the sound driver. alsaconf will try to do this, but it's not 100%% sure.
eu: ALSA KONFIGURATZAILEA %s bertsioa Script hau honetarako konfiguratzailea da: Advanced Linux Sound Architecture (ALSA) kontrolatzailea. ALSA jada lanean ari bada, itxi soinu-aplikazio guztiak eta geldiarazi soinu-kontrolatzailea. alsaconf hau burutzen saiatuko da, baina ez da erabat fidagarria.

source: OK, sound driver is configured. ALSA CONFIGURATOR will prepare the card for playing now. Now I'll run alsasound init script, then I'll use amixer to raise the default volumes. You can change the volume later via a mixer program such as alsamixer or gamix.
eu: Ados, soinu-kontrolatzailea konfiguratu da. ALSA KONFIGURATZAILEAk txartela erabiltzeko prest jarriko du. Orain alsasound init script-a abiaraziko du, ondoren amixer erabiliko dut bolumen lehenetsiak igotzeko. Bolumena gero aldatu dezakezu alsamixer edo gamix bezalako nahasgailu-programa bat erabilita.

source: Can't create temp file, exiting...
eu: Ezin da aldi baterako fitxategirik sortu, irteten...

source: Building card database..
eu: Txartel-datu-basea eraikitzen...

source: No card database is found..
eu: Ez da txartel-datu-baserik aurkitu...

source: Searching sound cards
eu: Soinu-txartelak bilatzen

source: Configuring %s Do you want to modify %s (and %s if present)?
eu: %s konfiguratzen %s aldatu nahi duzu (eta baita %s, baldin badago)?

source: Configuring %s Do you want to modify %s?
eu: %s konfiguratzen %s aldatu nahi duzu?

source: Running modules-update...
eu: Modulu-eguneraketa egiten...

source: Running update-modules...
eu: Eguneraketa-moduluak egiten...

source: The mixer is set up now for for playing. Shall I try to play a sound sample now? NOTE: If you have a big amplifier, lower your volumes or say no. Otherwise check that your speaker volume is open, and look if you can hear test sound.
eu: Nahasgailua orain erreproduzitzeko konfiguratuta dago. Nahi duzu orain bertan soinu-proba egitea? OHARRA: Anplifikadore handirik baduzu, jaitsi bolumena edo erantzun ezetz. Bestela ziurtatu zure bozgorailuaren bolumena aktibo dagoela eta begiratu probako soinua entzun dezakezun.

source: Saving the mixer setup used for this in /etc/asound.state.
eu: Honetarako erabilitako nahasgailuaren konfigurazioa /etc/asound.state fitxategian gordetzen.

source: =============================================================================== Now ALSA is ready to use. For adjustment of volumes, use your favorite mixer. Have a lot of fun!
eu: =============================================================================== Orain ALSA erabiltzeko prest dago. Bolumenak egokitzeko erabili nahi duzun nahasgailua. Gozatu!

source: WARNING
eu: ABISUA

source: Probing legacy ISA cards might make your system unstable. Do you want to proceed?
eu: ISA txartel zaharrak probatzeak zure sistema desegonkortu lezake. Aurrera egin nahi duzu?

source: No legacy drivers are available for your machine
eu: Ez dago kontrolatzaile zaharrik eskuragarri zure gailuan

source: Driver Selection
eu: Kontrolatzaile hautapena

source: Probing legacy ISA cards Please select the drivers to probe:
eu: ISA txartel zaharrak probatzea Hautatu probatzeko kontrolatzaileak:

source: Shall I try all possible DMA and IRQ combinations? With this option, some unconventional configuration might be found, but it will take much longer time.
eu: DMA eta IRQ konbinazio guztiak probatzea nahi duzu? Aukera honekin konfigurazio ezohikoren bat aurkitu liteke, baina denbora askoz ere gehiago hartuko du.

source: Probing legacy cards.. This may take a few minutes..
eu: Txartel zaharrak probatzen Honek minutu batzuk hartu litzake...

source: Probing:
eu: Probatzen:

source: : FOUND!!
eu: : AURKITU DA!!

source: Result
eu: Emaitza

source: No legacy cards found
eu: Ez da txartel zaharrik aurkitu

source: Looks like you having a Thinkpad 600E or 770 notebook. On this notebook, CS4236 driver should be used although CS46xx chip is detected. Shall I try to snd-cs4236 driver and probe the legacy ISA configuration?
eu: Badirudi Thinkpad 600E edo 770 eramangarri bat duzula. Eramangarri honetan CS4236 kontrolatzailea erabili beharko litzake nahiz eta CS46xx txipa detektatu. Nahi duzu snd-cs4236 kontrolatzailea eta ISA konfigurazio zaharra probatzea?

source: Looks like you having a Dell Dimension machine. On this machine, CS4232 driver should be used although CS46xx chip is detected. Shall I try to snd-cs4232 driver and probe the legacy ISA configuration?
eu: Badirudi Dell Dimension gailua duzula. Eramangarri honetan CS4232 kontrolatzailea erabili beharko litzake nahiz eta CS46xx txipa detektatu. Nahi duzu snd-cs42362kontrolatzailea eta ISA konfigurazio zaharra probatzea?

source: Soundcard Selection
eu: Soinu-txatel hautapena

source: Following card(s) are found on your system. Choose a soundcard to configure:
eu: Txartel hau(ek) dago/daude zure sisteman. Hautatu konfiguratzeko soinu-txartel bat:

source: No supported PnP or PCI card found. Would you like to probe legacy ISA sound cards/chips?
eu: Ez da aurkitu onartutako PnP edo PCI txartelik. Nahi duzu ISA soinu-txartel edo -txipak probatzea?
